# Erase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
InsulationTypeSet..::..Erase Method
InsulationTypeSet Class See Also
---
Removes a specified insulation type from the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	InsulationType item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As InsulationType _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	InsulationType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..InsulationTypeThe insulation type to be erased.
# ### Return Value
The number of insulation types that were erased from the set.
# See Also
InsulationTypeSet Class
Autodesk.Revit.DB.Electrical Namespace